Ran Plan for 2 projects:

1. project: `s3-prod` dir: `terraform/s3` workspace: `default`
1. project: `ecr-prod` dir: `terraform/ecr` workspace: `default`
---

### 1. project: `s3-prod` dir: `terraform/s3` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/FileFlow/103/default/terraform/s3/s3-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/FileFlow/103/default/terraform/s3": exit status 1
module.fileflow_uploads.aws_ssm_parameter.bucket_arn[0]: Refreshing state... [id=/shared/s3/fileflow-uploads-prod-bucket-arn]
module.fileflow_uploads.aws_ssm_parameter.bucket_name[0]: Refreshing state... [id=/shared/s3/fileflow-uploads-prod-bucket-name]
module.fileflow_uploads.aws_s3_bucket.this: Refreshing state... [id=fileflow-uploads-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # aws_kms_alias.s3 will be created
  + resource "aws_kms_alias" "s3" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/fileflow-s3-prod"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.s3 will be created
  + resource "aws_kms_key" "s3" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 30
      + description                        = "KMS key for FileFlow S3 bucket encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "fileflow-s3-kms-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "fileflow"
          + "Service"     = "fileflow-s3"
        }
      + tags_all                           = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "fileflow-s3-kms-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "fileflow"
          + "Service"     = "fileflow-s3"
        }
    }

  # module.fileflow_uploads.aws_ssm_parameter.bucket_arn[0] will be destroyed
  # (because aws_ssm_parameter.bucket_arn is not in configuration)
  - resource "aws_ssm_parameter" "bucket_arn" {
      - arn             = "arn:aws:ssm:ap-northeast-2:646886795421:parameter/shared/s3/fileflow-uploads-prod-bucket-arn" -> null
      - data_type       = "text" -> null
      - description     = "S3 bucket ARN for fileflow-uploads-prod" -> null
      - has_value_wo    = false -> null
      - id              = "/shared/s3/fileflow-uploads-prod-bucket-arn" -> null
      - name            = "/shared/s3/fileflow-uploads-prod-bucket-arn" -> null
      - tags            = {
          - "Component"   = "ssm-parameter"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "sensitive"
          - "Environment" = "prod"
          - "Lifecycle"   = "production"
          - "ManagedBy"   = "terraform"
          - "Name"        = "fileflow-uploads-prod"
          - "Owner"       = "platform@ryuqqq.com"
          - "Project"     = "infrastructure"
          - "Service"     = "fileflow-uploads"
        } -> null
      - tags_all        = {
          - "Component"   = "ssm-parameter"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "sensitive"
          - "Environment" = "prod"
          - "Lifecycle"   = "production"
          - "ManagedBy"   = "terraform"
          - "Name"        = "fileflow-uploads-prod"
          - "Owner"       = "platform@ryuqqq.com"
          - "Project"     = "infrastructure"
          - "Service"     = "fileflow-uploads"
        } -> null
      - tier            = "Standard" -> null
      - type            = "String" -> null
      - value           = (sensitive value) -> null
      - version         = 1 -> null
        # (2 unchanged attributes hidden)
    }

  # module.fileflow_uploads.aws_ssm_parameter.bucket_name[0] will be destroyed
  # (because aws_ssm_parameter.bucket_name is not in configuration)
  - resource "aws_ssm_parameter" "bucket_name" {
      - arn             = "arn:aws:ssm:ap-northeast-2:646886795421:parameter/shared/s3/fileflow-uploads-prod-bucket-name" -> null
      - data_type       = "text" -> null
      - description     = "S3 bucket name for fileflow-uploads-prod" -> null
      - has_value_wo    = false -> null
      - id              = "/shared/s3/fileflow-uploads-prod-bucket-name" -> null
      - name            = "/shared/s3/fileflow-uploads-prod-bucket-name" -> null
      - tags            = {
          - "Component"   = "ssm-parameter"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "sensitive"
          - "Environment" = "prod"
          - "Lifecycle"   = "production"
          - "ManagedBy"   = "terraform"
          - "Name"        = "fileflow-uploads-prod"
          - "Owner"       = "platform@ryuqqq.com"
          - "Project"     = "infrastructure"
          - "Service"     = "fileflow-uploads"
        } -> null
      - tags_all        = {
          - "Component"   = "ssm-parameter"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "sensitive"
          - "Environment" = "prod"
          - "Lifecycle"   = "production"
          - "ManagedBy"   = "terraform"
          - "Name"        = "fileflow-uploads-prod"
          - "Owner"       = "platform@ryuqqq.com"
          - "Project"     = "infrastructure"
          - "Service"     = "fileflow-uploads"
        } -> null
      - tier            = "Standard" -> null
      - type            = "String" -> null
      - value           = (sensitive value) -> null
      - version         = 1 -> null
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + kms_key_arn = (known after apply)
╷
│ Warning: Failed to decode resource from state
│ 
│ Error decoding
│ "module.fileflow_uploads.aws_s3_bucket_cors_configuration.this[0]" from
│ prior state: unsupported attribute "region"
╵
╷
│ Warning: Failed to decode resource from state
│ 
│ Error decoding
│ "module.fileflow_uploads.aws_s3_bucket_lifecycle_configuration.this[0]"
│ from prior state: unsupported attribute "region"
╵
╷
│ Warning: Failed to decode resource from state
│ 
│ Error decoding
│ "module.fileflow_uploads.aws_s3_bucket_public_access_block.this" from prior
│ state: unsupported attribute "region"
╵
╷
│ Warning: Failed to decode resource from state
│ 
│ Error decoding
│ "module.fileflow_uploads.aws_s3_bucket_server_side_encryption_configuration.this"
│ from prior state: unsupported attribute "region"
╵
╷
│ Warning: Failed to decode resource from state
│ 
│ Error decoding "module.fileflow_uploads.aws_s3_bucket_versioning.this[0]"
│ from prior state: unsupported attribute "region"
╵
╷
│ Error: reading S3 Bucket (fileflow-uploads-prod) policy: operation error S3: GetBucketPolicy, https response error StatusCode: 403, RequestID: M97PVNCEG40JV29N, HostID: pVS7m3XoGoMRUvmo89i8hEDFTIz8760r9qg331TVcdo/JB6wINFTk88vvzH0T08c2wYDYTco+eWcCq8kjFYjX123GPXVUrKo, api error AccessDenied: User: arn:aws:sts::646886795421:assumed-role/atlantis-ecs-task-prod/2b1ecc307dc54c88bd9abe50e4cc5b61 is not authorized to perform: s3:GetBucketPolicy on resource: "arn:aws:s3:::fileflow-uploads-prod" because no identity-based policy allows the s3:GetBucketPolicy action
│ 
│   with module.fileflow_uploads.aws_s3_bucket.this,
│   on .terraform/modules/fileflow_uploads/terraform/modules/s3-bucket/main.tf line 26, in resource "aws_s3_bucket" "this":
│   26: resource "aws_s3_bucket" "this" {
│ 
╵

```
</details>

---
### 2. project: `ecr-prod` dir: `terraform/ecr` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_kms_alias.ecr will be created
+ resource "aws_kms_alias" "ecr" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/fileflow-ecr-prod"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.ecr will be created
+ resource "aws_kms_key" "ecr" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 30
      + description                        = "KMS key for FileFlow ECR repository encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "fileflow-ecr-kms-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "fileflow"
          + "Service"     = "fileflow-ecr"
        }
      + tags_all                           = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "fileflow-ecr-kms-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "fileflow"
          + "Service"     = "fileflow-ecr"
        }
    }

  # module.ecr_scheduler.aws_ecr_lifecycle_policy.this[0] must be replaced
-/+ resource "aws_ecr_lifecycle_policy" "this" {
      ~ id          = "fileflow-scheduler-prod" -> (known after apply)
      ~ policy      = jsonencode(
          ~ {
              ~ rules = [
                  ~ {
                      ~ selection    = {
                          ~ tagPrefixList = [
                                "v",
                              + "prod",
                              + "latest",
                            ]
                            # (3 unchanged attributes hidden)
                        }
                        # (3 unchanged attributes hidden)
                    },
                    {
                        action       = {
                            type = "expire"
                        }
                        description  = "Delete untagged images after 7 days"
                        rulePriority = 2
                        selection    = {
                            countNumber = 7
                            countType   = "sinceImagePushed"
                            countUnit   = "days"
                            tagStatus   = "untagged"
                        }
                    },
                ]
            } # forces replacement
        )
      ~ registry_id = "646886795421" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.ecr_scheduler.aws_ecr_repository.this must be replaced
-/+ resource "aws_ecr_repository" "this" {
      ~ arn                  = "arn:aws:ecr:ap-northeast-2:646886795421:repository/fileflow-scheduler-prod" -> (known after apply)
      ~ id                   = "fileflow-scheduler-prod" -> (known after apply)
      ~ image_tag_mutability = "IMMUTABLE" -> "MUTABLE"
        name                 = "fileflow-scheduler-prod"
      ~ registry_id          = "646886795421" -> (known after apply)
      ~ repository_url       = "646886795421.dkr.ecr.ap-northeast-2.amazonaws.com/fileflow-scheduler-prod" -> (known after apply)
      ~ tags                 = {
            "Component"   = "container-registry"
            "CostCenter"  = "engineering"
          ~ "DataClass"   = "confidential" -> "internal"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "ecr-fileflow-scheduler-prod"
            "Owner"       = "platform@ryuqqq.com"
          ~ "Project"     = "infrastructure" -> "fileflow"
            "Service"     = "fileflow-scheduler"
        }
      ~ tags_all             = {
          ~ "DataClass"   = "confidential" -> "internal"
          ~ "Project"     = "infrastructure" -> "fileflow"
            # (8 unchanged elements hidden)
        }

      ~ encryption_configuration {
          ~ encryption_type = "AES256" # forces replacement -> (known after apply) # forces replacement
          + kms_key         = (known after apply) # forces replacement
        }

        # (1 unchanged block hidden)
    }

  # module.ecr_scheduler.aws_ssm_parameter.repository-url[0] will be updated in-place
~ resource "aws_ssm_parameter" "repository-url" {
        id              = "/shared/ecr/fileflow-scheduler-prod-repository-url"
      + insecure_value  = (known after apply)
        name            = "/shared/ecr/fileflow-scheduler-prod-repository-url"
      ~ tags            = {
            "CostCenter"  = "engineering"
          ~ "DataClass"   = "confidential" -> "internal"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Owner"       = "platform@ryuqqq.com"
          ~ "Project"     = "infrastructure" -> "fileflow"
            "Service"     = "fileflow-scheduler"
        }
      ~ tags_all        = {
          ~ "DataClass"   = "confidential" -> "internal"
          ~ "Project"     = "infrastructure" -> "fileflow"
            # (6 unchanged elements hidden)
        }
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.ecr_web_api.aws_ecr_lifecycle_policy.this[0] must be replaced
-/+ resource "aws_ecr_lifecycle_policy" "this" {
      ~ id          = "fileflow-web-api-prod" -> (known after apply)
      ~ policy      = jsonencode(
          ~ {
              ~ rules = [
                  ~ {
                      ~ selection    = {
                          ~ tagPrefixList = [
                                "v",
                              + "prod",
                              + "latest",
                            ]
                            # (3 unchanged attributes hidden)
                        }
                        # (3 unchanged attributes hidden)
                    },
                    {
                        action       = {
                            type = "expire"
                        }
                        description  = "Delete untagged images after 7 days"
                        rulePriority = 2
                        selection    = {
                            countNumber = 7
                            countType   = "sinceImagePushed"
                            countUnit   = "days"
                            tagStatus   = "untagged"
                        }
                    },
                ]
            } # forces replacement
        )
      ~ registry_id = "646886795421" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.ecr_web_api.aws_ecr_repository.this must be replaced
-/+ resource "aws_ecr_repository" "this" {
      ~ arn                  = "arn:aws:ecr:ap-northeast-2:646886795421:repository/fileflow-web-api-prod" -> (known after apply)
      ~ id                   = "fileflow-web-api-prod" -> (known after apply)
      ~ image_tag_mutability = "IMMUTABLE" -> "MUTABLE"
        name                 = "fileflow-web-api-prod"
      ~ registry_id          = "646886795421" -> (known after apply)
      ~ repository_url       = "646886795421.dkr.ecr.ap-northeast-2.amazonaws.com/fileflow-web-api-prod" -> (known after apply)
      ~ tags                 = {
            "Component"   = "container-registry"
            "CostCenter"  = "engineering"
          ~ "DataClass"   = "confidential" -> "internal"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "ecr-fileflow-web-api-prod"
            "Owner"       = "platform@ryuqqq.com"
          ~ "Project"     = "infrastructure" -> "fileflow"
            "Service"     = "fileflow-web-api"
        }
      ~ tags_all             = {
          ~ "DataClass"   = "confidential" -> "internal"
          ~ "Project"     = "infrastructure" -> "fileflow"
            # (8 unchanged elements hidden)
        }

      ~ encryption_configuration {
          ~ encryption_type = "AES256" # forces replacement -> (known after apply) # forces replacement
          + kms_key         = (known after apply) # forces replacement
        }

        # (1 unchanged block hidden)
    }

  # module.ecr_web_api.aws_ssm_parameter.repository-url[0] will be updated in-place
~ resource "aws_ssm_parameter" "repository-url" {
        id              = "/shared/ecr/fileflow-web-api-prod-repository-url"
      + insecure_value  = (known after apply)
        name            = "/shared/ecr/fileflow-web-api-prod-repository-url"
      ~ tags            = {
            "CostCenter"  = "engineering"
          ~ "DataClass"   = "confidential" -> "internal"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Owner"       = "platform@ryuqqq.com"
          ~ "Project"     = "infrastructure" -> "fileflow"
            "Service"     = "fileflow-web-api"
        }
      ~ tags_all        = {
          ~ "DataClass"   = "confidential" -> "internal"
          ~ "Project"     = "infrastructure" -> "fileflow"
            # (6 unchanged elements hidden)
        }
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 6 to add, 2 to change, 4 to destroy.

Changes to Outputs:
+ kms_key_arn              = (known after apply)
~ scheduler_repository_arn = "arn:aws:ecr:ap-northeast-2:646886795421:repository/fileflow-scheduler-prod" -> (known after apply)
~ scheduler_repository_url = "646886795421.dkr.ecr.ap-northeast-2.amazonaws.com/fileflow-scheduler-prod" -> (known after apply)
~ web_api_repository_arn   = "arn:aws:ecr:ap-northeast-2:646886795421:repository/fileflow-web-api-prod" -> (known after apply)
~ web_api_repository_url   = "646886795421.dkr.ecr.ap-northeast-2.amazonaws.com/fileflow-web-api-prod" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p ecr-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FFileFlow%252Fterraform%252Fecr%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p ecr-prod
  ```
Plan: 6 to add, 2 to change, 4 to destroy.

---
### Plan Summary

2 projects, 1 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```